---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarWithDelayedConstraints
source: html/b80a07f4-e321-27e9-6a1c-55b5ec97bd20.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarWithDelayedConstraints Property

There are rebar handles with invalid selected targets to constrain. The bar preview corresponds to latest valid constraints.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSolveRebarWithDelayedConstraints { get; }
```